viikko6/app/controllers/beers_controller.rb

SELECT "breweries".* FROM "breweries"
SELECT "styles".* FROM "styles"
---
  def new
    @beer = Beer.new
    @breweries = Brewery.all
    @styles = Style.all

INSERT INTO "beers" ("brewery_id", "created_at", "name", "style_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["brewery_id", 1], ["created_at", "2015-02-15 20:24:11.527764"], ["name", "Blob"], ["style_id", 1], ["updated_at", "2015-02-15 20:24:11.527764"]]
---
  def create
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save

SELECT "breweries".* FROM "breweries"
SELECT  "styles".* FROM "styles"  WHERE "styles"."beer_id" = ? LIMIT 1  [[nil, 1]]
---
    def set_breweries_and_styles_for_template
      @breweries = Brewery.all
      @styles = Style.all