viikko6/app/controllers/beer_clubs_controller.rb

SELECT "memberships".* FROM "memberships"  WHERE "memberships"."user_id" = ?  [["user_id", 1]]
---
  def show
    @membership = Membership.new
    @membership.beer_club = @beer_club

    if current_user.nil?
      return
    else
      current_user.memberships.each do |f|