viikko6/app/controllers/memberships_controller.rb

  def new
    @beer_clubs = BeerClub.all.reject{ |b| b.members.include? current_user }
---
SELECT "beer_clubs".* FROM "beer_clubs"

  def create
    @membership = Membership.new(membership_params)
    @membership.user = current_user

    respond_to do |format|
      if @membership.save
---
INSERT INTO "memberships" ("beer_club_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["beer_club_id", 1], ["created_at", "2015-02-14 11:28:50.141812"], ["updated_at", "2015-02-14 11:28:50.141812"], ["user_id", 1]]

  def destroy
    @membership.destroy
---
DELETE FROM "memberships" WHERE "memberships"."id" = ?  [["id", 1]]