viikko6/app/controllers/ratings_controller.rb

SELECT "ratings".* FROM "ratings"  WHERE "ratings"."created_at" = 't'
---
  def index
    @ratings = Rating.all

INSERT INTO "ratings" ("beer_id", "created_at", "score", "updated_at") VALUES (?, ?, ?, ?)  [["beer_id", 1], ["created_at", "2015-02-13 22:45:53.288311"], ["score", 19], ["updated_at", "2015-02-13 22:45:53.288311"]]
SELECT "beers".* FROM "beers"
---
  def create
    @rating = Rating.new params.require(:rating).permit(:score, :beer_id)

    if current_user.nil?
      redirect_to signin_path, notice:'you should be signed in'
    elsif @rating.save
      current_user.ratings << @rating  ## virheen aiheuttanut rivi
      redirect_to user_path current_user
    else
      @beers = Beer.all