app/views/beers/show.html.erb

<p>
  Has <%= @beer.ratings.count %> <%= "rating".pluralize(@beer.ratings.count) %>, average <%= @beer.average_rating %>
---
SELECT "ratings".* FROM "ratings"  WHERE "ratings"."beer_id" = ?  [["beer_id", 1]]
SELECT COUNT(*) FROM "ratings"  WHERE "ratings"."beer_id" = ?  [["beer_id", 1]]