app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?)  [["created_at", "2015-02-13 22:45:15.513370"], ["password_digest", "$2a$10$ZvoDRsdRUwzNKAjCn35RkOEpr9Nftgm6pDIl.oL70y/D3kly.BjYa"], ["updated_at", "2015-02-13 22:45:15.513370"], ["username", "Bob"]]