viikko6/app/views/ratings/index.html.erb

SELECT "ratings".* FROM "ratings"  WHERE "ratings"."user_id" = ?  [["user_id", 3]]
SELECT COUNT(*) FROM "ratings"  WHERE "ratings"."user_id" = ?  [["user_id", 1]]
---
        <td><%= user.favorite_brewery %></td>
        <td><%= user.ratings.count %></td>